tap "homebrew/cask-cask"
tap "homebrew/cask-versions", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
cask_args appdir: "/Applications"

# install packages
tap "caskroom/homebrew-cask" || true
tap "caskroom/versions" || true
brew "git"
brew "bash-completion"
brew "tree"
brew "node"
brew "wget"
brew "node"

# Casks
cask "1password"
cask "alfred"
cask "dbeaver-community"
cask "dbngin"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "loom"
cask "postico"
cask "postgres"
cask "postman"
cask "shift"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "station"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

# for react native to run the facebook F8 app
# https://github.com/fbsamples/f8app

# https://facebook.github.io/watchman/docs/install.html
brew "watchman"
# http://www.flowtype.org/
brew "flow"
# https://www.mongodb.org/downloads#production
# brew "mongodb"

# A command to download mac store app
# http://www.softantenna.com/wp/mac/mas-cli/
# https://github.com/argon/mas
tap "argon/mas"
brew "mas"
# run download_apps later on

# Be Focused (1.7.8)
mas "Be Focused", id: 973134470
# Drafts (18.1)
mas "Drafts", id: 1435957248
# Kelir (1.5)
mas "Kelir", id: 1145215534
# Kindle (1.28.0)
mas "Kindle", id: 405399194
# Magnet (2.4.5)
mas "Magnet", id: 441258766 
# Monosnap (3.6.4)
mas "Monosnap", id: 540348655
# Paste (2.6.2)
mas "Paste", id: 967805235
# Time Out (2.6.2)
mas "Time Out", id: 402592703
# Todoist (7.2.6)
mas "Todoist", id: 585829637
# Xcode (11.3.1)
mas "Xcode", id: 497799835
